a = int(input("a = ")) # * указывам a,b и c 
b = int(input("b = ")) 
c = int(input("c = "))  

d = b**2 - 4 * a * c # ** вычисление самого дискриминанта
print(f"Дискриминант числа = {d}")

def X1():
	x1 = (-b + d**0.5) / (2 * a) # ** иксы, ну вы поняли 
	return(f"x1 = {x1}")

def X2():
	x2 = (-b - d**0.5) / (2 * a) # ! важная штука, число взятое в степень 0.5 - тоже самое что квадратный корень
	return(f"x2 = {x2}")
if d > 0:
	print(f"{X1()}\n{X2()}") 
elif d == 0:
	x1 = -b / (2 * a)
	print(f"корень 1, X =P{x1}")
else: 
	print("Иксы не найти, довольствуйся дискриминантом")
									