#Задание 3
num =int(input("Введите число:"))
f = 1 
for i in range(1,num +1):
 f = f * i
print(f)